//
////  main.m
////  FoudationTask
////
////  Created by wei.chen on 12-12-14.
////  Copyright (c) 2012年 www.iphonetrain.com 无限互联3G学院. All rights reserved.
////
//
#import <Foundation/Foundation.h>

int main(int argc, const char * argv[])
{
//
     
///*______________________________字符串练习_______________________________*/
//
//        //1.快速创建
     
//        //2.alloc创建的字符串
    
//        //3.alloc通过格式化符创建
     
          //4.类方法通过格式化符创建 
         
//        //5.比较字符串是否相同
        // 比较字符串的指针地址

         
        //比较字符串的内容
         
         // 6.比较字符串大小
                   
//        //7.字符串长度
     

//        //8.大小写转换


          
//        //9.转换为基本数据类型
 
        
//        //10.分割字符串

//        
//        //11.访问指定位置字符
       
//        
//        //字符串的截取
        
         
//        //12.1截取到指定位置

//        
//        //12.2从指定位置截取到末尾

//        
//        //12.3指定范围截取
//        
//        //13.三种 拼接字符串方式

//        
//        //14.查找字符串

        
        //15.替换字符串
        
/*______________________________数组练习_______________________________*/        

        //1.通过alloc创建
    
        //2.通过类方法创建
        
        //3.获取下标为0的对象
        
        //4.数组中的元素个数
        
        //5.判断是否包含某个对象
        
        //6.对象在数组中的索引位置
        
        //7.连接数组中的字符串
        
        //8.最后一个元素对象
        
        //9.xcode4.4新语法创建数组
        
        //10.xcode4.4新语法访问数组中的元素
        
        /*******可变数组的练习******/
        //11.创建可变数组，设定5个存储空间
        
        //12.添加元素
        
        //13.指定位置插入元素
        
        //14.替换元素
        
        //15.互换两个元素的位置
        
        //16.将另外一个数组中的元素添加到当前数组中。
        
        //17.删除指定位置的元素
        
        //18.删除指定的对象
        
        //19.删除最后一个元素
        
        //20.删除所有元素
        
        //21.使用三种循环遍历一数组。
        
   
    return 0;
}

